In [1]:
# Impor necessary libraries

import pandas as pd
import numpy as np

### Uploading all the datasets and Removing Unnecessary columns one by one

In [2]:
# Load "orders_dataset.csv" dataset 

df_delivery_data = pd.read_csv("orders_dataset.csv")

print(df_delivery_data.columns)
df_delivery_data.head()

Index(['order_id', 'customer_id', 'order_status', 'order_purchase_timestamp',
       'order_approved_at', 'order_delivered_carrier_date',
       'order_delivered_customer_date', 'order_estimated_delivery_date'],
      dtype='object')

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,02/10/2017 10:56,02/10/2017 11:07,04/10/2017 19:55,10/10/2017 21:25,18/10/2017 00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,24/07/2018 20:41,26/07/2018 03:24,26/07/2018 14:31,07/08/2018 15:27,13/08/2018 00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,08/08/2018 08:38,08/08/2018 08:55,08/08/2018 13:50,17/08/2018 18:06,04/09/2018 00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,18/11/2017 19:28,18/11/2017 19:45,22/11/2017 13:39,02/12/2017 00:28,15/12/2017 00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,13/02/2018 21:18,13/02/2018 22:20,14/02/2018 19:46,16/02/2018 18:17,26/02/2018 00:00

In [3]:
df_delivery_data.drop(['customer_id', 'order_status', 'order_purchase_timestamp', 'order_delivered_carrier_date','order_estimated_delivery_date'], axis=1, inplace=True)

In [4]:
df_delivery_data.head()

,order_id,order_approved_at,order_delivered_customer_date
0,e481f51cbdc54678b7cc49136f2d6af7,02/10/2017 11:07,10/10/2017 21:25
1,53cdb2fc8bc7dce0b6741e2150273451,26/07/2018 03:24,07/08/2018 15:27
2,47770eb9100c2d0c44946d9cf07ec65d,08/08/2018 08:55,17/08/2018 18:06
3,949d5b44dbf5de918fe9c16f97b45f8a,18/11/2017 19:45,02/12/2017 00:28
4,ad21c59c0840e6cb83a9ceb5573f8159,13/02/2018 22:20,16/02/2018 18:17

In [5]:
# Load "order_items_dataset.csv" dataset

df_price = pd.read_csv("order_items_dataset.csv")
print(df_price.columns)
df_price.head(5)

Index(['order_id', 'order_item_id', 'product_id', 'seller_id',
       'shipping_limit_date', 'price', 'freight_value'],
      dtype='object')

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,19/09/2017 09:45,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,03/05/2017 11:05,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,18/01/2018 14:48,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,15/08/2018 10:10,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,13/02/2017 13:57,199.90,18.14

In [6]:
df_price.drop(['order_item_id', 'seller_id', 'shipping_limit_date', 'freight_value'], axis=1, inplace=True)

In [7]:
print(df_price.shape)
df_price.head()

(112650, 3)

                           order_id                        product_id   price
0  00010242fe8c5a6d1ba2dd792cb16214  4244733e06e7ecb4970a6e2683c13e61   58.90
1  00018f77f2f0320c557190d7a144bdd3  e5f2d52b802189ee658865ca93d83a8f  239.90
2  000229ec398224ef6ca0657da4fc703e  c777355d18b72b67abbeef9df44fd0fd  199.00
3  00024acbcdf0a6daa1e931b038114c75  7634da152a4610f1595efa32f14722fc   12.99
4  00042b26cf59d7ce69dfabb4e55b4fd9  ac6c3623068f30de03045865e4e10089  199.90

In [9]:
# Load "review_with_labeled.xlsx" dataset

df_review = pd.read_excel("review_with_labelled.xlsx")
print(df_review.columns)
df_review.head()

Index(['order_id', 'reviews', 'label'], dtype='object')

,order_id,reviews,label
0,658677c97b385a9be170737859d3511b,recebi bem antes do prazo estipulado,1
1,8e6bfb81e283fa7e4f11123a3fb894f1,parabéns lojas lannister adorei comprar pela ...,1
2,b9bf720beb4ab3728760088589c62129,recomendo aparelho eficiente no site a marca d...,1
3,9d6f15f95d01e79bd1349cc208361f09,mas um pouco travandopelo valor ta boa\n,1
4,e51478e7e277a83743b6f9991dbfa3fb,super recomendo vendedor confiável produto ok ...,1

In [10]:
# Drop reviews column

df_review.drop(['reviews'], axis=1, inplace=True)

In [11]:
df_review.head()

                           order_id  label
0  658677c97b385a9be170737859d3511b      1
1  8e6bfb81e283fa7e4f11123a3fb894f1      1
2  b9bf720beb4ab3728760088589c62129      1
3  9d6f15f95d01e79bd1349cc208361f09      1
4  e51478e7e277a83743b6f9991dbfa3fb      1

In [12]:
# Load Product "products_dataset.csv" and "product_category_name_translation.csv"
# "product_category_name_translation.csv" contain product category name in English of portugueses category name

df_cat_pt = pd.read_csv("products_dataset.csv")
df_cat_en = pd.read_csv("product_category_n_en.csv")

df_cat_en.head()

    product_category_name product_category_name_english
0            beleza_saude                 health_beauty
1  informatica_acessorios         computers_accessories
2              automotivo                          auto
3         cama_mesa_banho                bed_bath_table
4        moveis_decoracao               furniture_decor

In [13]:
df_cat_en.isnull().sum()

product_category_name            0
product_category_name_english    0
dtype: int64

In [14]:
print(df_cat_pt.columns)
df_cat_pt.head()

Index(['product_id', 'product_category_name', 'product_name_lenght',
       'product_description_lenght', 'product_photos_qty', 'product_weight_g',
       'product_length_cm', 'product_height_cm', 'product_width_cm'],
      dtype='object')

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [15]:
# Revome innecessary columns

df_cat_pt.drop(['product_name_lenght', 'product_description_lenght', 'product_photos_qty', 'product_weight_g',
       'product_length_cm', 'product_height_cm', 'product_width_cm'], axis=1, inplace=True)

In [16]:
df_cat_pt.head()

                         product_id  product_category_name
0  1e9e8ef04dbcff4541ed26657ea517e5             perfumaria
1  3aa071139cb16b67ca9e5dea641aaa2f                  artes
2  96bd76ec8810374ed1b65e291975717f          esporte_lazer
3  cef67bcfe19066a932b7673e239eb23d                  bebes
4  9dc1a7de274444849c219cff195d0b71  utilidades_domesticas

In [17]:
# Create two list, one contains portugues categoru name and other contain coresponding english category name. 

pt_ca_n = np.array(df_cat_en["product_category_name"]) # portugues categoru name
en_ca_n = np.array(df_cat_en["product_category_name_english"]) # english category name

In [18]:
df_product_cat = df_cat_pt.replace(pt_ca_n,en_ca_n) # Replace Category name in English

print(df_product_cat.shape)
df_product_cat.head()

(32951, 2)

                         product_id product_category_name
0  1e9e8ef04dbcff4541ed26657ea517e5             perfumery
1  3aa071139cb16b67ca9e5dea641aaa2f                   art
2  96bd76ec8810374ed1b65e291975717f        sports_leisure
3  cef67bcfe19066a932b7673e239eb23d                  baby
4  9dc1a7de274444849c219cff195d0b71            housewares

### Merge all dataframe one by one

In [19]:
# merge df_price and df_product_cat on product_id column

merged_price_cat_df = pd.merge( df_price, df_product_cat, on = "product_id", how = "inner", indicator=True)

In [20]:
print(merged_price_cat_df.shape, merged_price_cat_df._merge.unique())
merged_price_cat_df.tail()

(112650, 5) ['both']
Categories (1, object): ['both']

,order_id,product_id,price,product_category_name,_merge
112645,ffebd80e3291e811c308365936897efd,4cc4d02efc8f249c13355147fb44e34d,129.9,garden_tools,both
112646,ffee31fb4b5e35c9123608015637c495,b10ecf8e33aaaea419a9fa860ea80fb5,99.0,furniture_decor,both
112647,fff7c4452f050315db1b3f24d9df5fcd,dd469c03ad67e201bc2179ef077dcd48,736.0,watches_gifts,both
112648,fffa82886406ccf10c7b4e35c4ff2788,bbe7651fef80287a816ead73f065fc4b,229.9,sports_leisure,both
112649,fffe41c64501cc87c801fd61db3f6244,350688d9dc1e75ff97be326363655e01,43.0,bed_bath_table,both

In [21]:
# dropping duplicate rows 

merge_a = merged_price_cat_df.drop_duplicates()

In [22]:
# remove product_id column
merge01 = merge_a.copy()
merge01.drop(["product_id", "_merge"], axis=1, inplace=True)

In [23]:
merge01.head(3)

                           order_id  price product_category_name
0  00010242fe8c5a6d1ba2dd792cb16214   58.9            cool_stuff
1  130898c0987d1801452a8ed92a670612   55.9            cool_stuff
2  532ed5e14e24ae1f0d735b91524b98b9   64.9            cool_stuff

In [24]:
# Merge df_delivery_data, df_review columns on order_id values

merge02 = pd.merge(df_delivery_data, df_review, on="order_id", how="inner", indicator=True)

In [25]:
print(merge02.shape, merge02._merge.unique())
merge02.head()

(38573, 5) ['both']
Categories (1, object): ['both']

,order_id,order_approved_at,order_delivered_customer_date,label,_merge
0,e481f51cbdc54678b7cc49136f2d6af7,02/10/2017 11:07,10/10/2017 21:25,1,both
1,53cdb2fc8bc7dce0b6741e2150273451,26/07/2018 03:24,07/08/2018 15:27,1,both
2,949d5b44dbf5de918fe9c16f97b45f8a,18/11/2017 19:45,02/12/2017 00:28,1,both
3,136cce7faa42fdb2cefd53fdc79a6098,13/04/2017 13:25,NaN,0,both
4,e6ce16cb79ec1d90b1da9085a6118aeb,16/05/2017 19:50,29/05/2017 11:18,0,both

In [26]:
# drop the "_merge" column
merge02.drop(["_merge"], axis=1, inplace=True)

In [27]:
merge_final = pd.merge(merge02, merge01, on="order_id", how="inner", indicator=True)

In [28]:
print(merge_final.shape, merge_final._merge.unique())
merge_final.head()

(40111, 7) ['both']
Categories (1, object): ['both']

,order_id,order_approved_at,order_delivered_customer_date,label,price,product_category_name,_merge
0,e481f51cbdc54678b7cc49136f2d6af7,02/10/2017 11:07,10/10/2017 21:25,1,29.99,housewares,both
1,53cdb2fc8bc7dce0b6741e2150273451,26/07/2018 03:24,07/08/2018 15:27,1,118.70,perfumery,both
2,949d5b44dbf5de918fe9c16f97b45f8a,18/11/2017 19:45,02/12/2017 00:28,1,45.00,pet_shop,both
3,136cce7faa42fdb2cefd53fdc79a6098,13/04/2017 13:25,NaN,0,49.90,NaN,both
4,e6ce16cb79ec1d90b1da9085a6118aeb,16/05/2017 19:50,29/05/2017 11:18,0,99.00,garden_tools,both

In [29]:
# drop "_merge" colums
merge_final.drop(["_merge"], axis=1, inplace=True)

In [30]:
# Checking NaN values

print(merge_final.shape)
merge_final.isnull().sum()

(40111, 6)

order_id                            0
order_approved_at                   6
order_delivered_customer_date    1427
label                               0
price                               0
product_category_name             583
dtype: int64

In [31]:
# Droping all rows those have NaN values

merge_final_a = merge_final.dropna()
merge_final_a.shape

(38130, 6)

In [32]:
# removing duplicated Rows

merge_final_a.duplicated().sum()

532

In [33]:
merge_final_b = merge_final_a.drop_duplicates()

In [34]:
print(merge_final_b.shape)
merge_final_b.sample(8)

(37598, 6)

,order_id,order_approved_at,order_delivered_customer_date,label,price,product_category_name
23280,3b550d526029241325a94aa30a60cff0,08/09/2017 14:25,13/09/2017 15:07,0,24.41,sports_leisure
33628,10ce8dab3f76d4cdd5dd2e9c6d5c3feb,13/01/2018 10:04,28/01/2018 13:36,1,54.70,home_construction
18841,bbb1e23de4c2eba23ab1ad0da89f47b7,02/04/2018 09:35,13/04/2018 22:28,1,17.99,electronics
38458,66953b497ee497a9823fab9b0addc8b6,20/01/2018 15:22,02/02/2018 23:08,1,49.90,garden_tools
38146,047e0e88828680c6cd9c476d555823e2,22/05/2018 08:56,14/06/2018 21:18,0,25.52,computers_accessories
18758,21ac7b9aaf4cb4e41aa7ed2722a0c2ab,24/05/2018 18:38,06/06/2018 19:04,0,39.90,home_construction
1328,94a224f03c816cd9a1d94b886e26da80,04/03/2018 18:48,13/04/2018 19:14,0,149.90,watches_gifts
11264,a15e73bbba8b02796a4e55ac24ed1763,08/05/2018 19:35,16/05/2018 15:26,1,145.00,watches_gifts

### chage "order_approved_at","order_delivered_customer_date","order_estimated_delivery_date" column into date formate keep only dates and after midnight it chage into next day.

In [35]:
merge_final_c = merge_final_b.copy()
merge_final_c["order_approved_at"] = pd.to_datetime(merge_final_c["order_approved_at"]).dt.normalize()
merge_final_c["order_delivered_customer_date"] = pd.to_datetime(merge_final_c["order_delivered_customer_date"]).dt.normalize()
merge_final_c.sample(5)

,order_id,order_approved_at,order_delivered_customer_date,label,price,product_category_name
31817,1ad631eef80afb67f53ed0b9083846e7,2018-07-19,2018-08-14,1,139.99,office_furniture
26508,d7918e406132d7c81f1b845276b03a3b,2017-07-14,2017-08-17,0,29.90,furniture_decor
33819,c71168b3286e7c26a34e005edb6a63e8,2017-07-16,2017-07-24,1,114.97,furniture_living_room
6404,d06fe8d6f4bdfe9cd1992aa3322f2f47,2018-07-06,2018-06-21,1,129.00,home_confort
5744,60bcba6747ee878b9007f61275f4cd1f,2018-04-18,2018-04-23,1,249.90,bed_bath_table

### Create a new columns , that carries how many day it takes to delivery the product.

In [36]:
from datetime import datetime

In [37]:
# create a function that calculate the day from order_approved_at and orde_delivered_customer_date columns

dates_list = []
def dates (a,b):
    day = b - a
    count_day = day.days
    dates_list.append(count_day)

for i in range (merge_final_c.shape[0]):
    try:
        dates(merge_final_c["order_approved_at"][i],merge_final_c["order_delivered_customer_date"][i])
    except:
        dates_list.append("not_date")

In [38]:
# create the delivery_days column

merge_final_c["delivery_days"] = dates_list

In [39]:
merge_final_c.head()

,order_id,order_approved_at,order_delivered_customer_date,label,price,product_category_name,delivery_days
0,e481f51cbdc54678b7cc49136f2d6af7,2017-02-10,2017-10-10,1,29.99,housewares,242
1,53cdb2fc8bc7dce0b6741e2150273451,2018-07-26,2018-07-08,1,118.70,perfumery,-18
2,949d5b44dbf5de918fe9c16f97b45f8a,2017-11-18,2017-02-12,1,45.00,pet_shop,-279
4,e6ce16cb79ec1d90b1da9085a6118aeb,2017-05-16,2017-05-29,0,99.00,garden_tools,not_date
5,432aaf21d85167c2c86ec9448c4e42cc,2018-01-03,2018-12-03,1,38.25,toys,13

In [40]:
# in delivery_dates column, the fuction unable to calculate day form those 2 columns. so function put as not_date on those row.
# so we have to remove those row.

merge_final_c[merge_final_c.delivery_days=="not_date"].shape

(2347, 7)

In [41]:
merge_final_d = merge_final_c[~(merge_final_c.delivery_days=="not_date")]

In [42]:
# In this dataset there are so my wrong data in "order_approved_at" and "order_delivered_customer_date" columns
# sometimes data says that product is delivered before it order approve date. so we have to handle those data.
# remove those row where delivery_days is negative

merge_final_d[merge_final_d.delivery_days < 0].shape

(10503, 7)

In [43]:
merge_final_f = merge_final_d[~(merge_final_d.delivery_days < 0)]

In [44]:
merge_final_f.shape

(24748, 7)

In [45]:
merge_final_f.head()

,order_id,order_approved_at,order_delivered_customer_date,label,price,product_category_name,delivery_days
0,e481f51cbdc54678b7cc49136f2d6af7,2017-02-10,2017-10-10,1,29.99,housewares,242
5,432aaf21d85167c2c86ec9448c4e42cc,2018-01-03,2018-12-03,1,38.25,toys,13
6,dcb36b511fcac050b97cd5c05de84dc3,2018-12-06,2018-06-21,1,132.40,perfumery,334
11,acce194856392f074dbf9dada14d8d82,2018-05-06,2018-06-16,0,39.50,baby,27
12,acce194856392f074dbf9dada14d8d82,2018-05-06,2018-06-16,0,90.90,baby,41

In [46]:
# Remove unnecessary colums 

df_final = merge_final_f.drop(["order_id", "order_approved_at","order_delivered_customer_date"], axis=1)

In [47]:
df_final.head()

    label   price product_category_name delivery_days
0       1   29.99            housewares           242
5       1   38.25                  toys            13
6       1  132.40             perfumery           334
11      0   39.50                  baby            27
12      0   90.90                  baby            41

In [48]:
df_final.isnull().sum()

label                    0
price                    0
product_category_name    0
delivery_days            0
dtype: int64

In [49]:
# Now the dataset is ready for creating ML model so save the df_final into a csv file.

df_final.to_csv("merged_cleaned_data.csv", index=False)